dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF15 */
#define IFX_CAN_N_TX_BCF_CF15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF16 */
#define IFX_CAN_N_TX_BCF_CF16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF16 */
#define IFX_CAN_N_TX_BCF_CF16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF16 */
#define IFX_CAN_N_TX_BCF_CF16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF17 */
#define IFX_CAN_N_TX_BCF_CF17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF17 */
#define IFX_CAN_N_TX_BCF_CF17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF17 */
#define IFX_CAN_N_TX_BCF_CF17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF18 */
#define IFX_CAN_N_TX_BCF_CF18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF18 */
#define IFX_CAN_N_TX_BCF_CF18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF18 */
#define IFX_CAN_N_TX_BCF_CF18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF19 */
#define IFX_CAN_N_TX_BCF_CF19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF19 */
#define IFX_CAN_N_TX_BCF_CF19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF19 */
#define IFX_CAN_N_TX_BCF_CF19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF20 */
#define IFX_CAN_N_TX_BCF_CF20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF20 */
#define IFX_CAN_N_TX_BCF_CF20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF20 */
#define IFX_CAN_N_TX_BCF_CF20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF21 */
#define IFX_CAN_N_TX_BCF_CF21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF21 */
#define IFX_CAN_N_TX_BCF_CF21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF21 */
#define IFX_CAN_N_TX_BCF_CF21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF22 */
#define IFX_CAN_N_TX_BCF_CF22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF22 */
#define IFX_CAN_N_TX_BCF_CF22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF22 */
#define IFX_CAN_N_TX_BCF_CF22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF23 */
#define IFX_CAN_N_TX_BCF_CF23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF23 */
#define IFX_CAN_N_TX_BCF_CF23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF23 */
#define IFX_CAN_N_TX_BCF_CF23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF24 */
#define IFX_CAN_N_TX_BCF_CF24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF24 */
#define IFX_CAN_N_TX_BCF_CF24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF24 */
#define IFX_CAN_N_TX_BCF_CF24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF25 */
#define IFX_CAN_N_TX_BCF_CF25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF25 */
#define IFX_CAN_N_TX_BCF_CF25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF25 */
#define IFX_CAN_N_TX_BCF_CF25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF26 */
#define IFX_CAN_N_TX_BCF_CF26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF26 */
#define IFX_CAN_N_TX_BCF_CF26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF26 */
#define IFX_CAN_N_TX_BCF_CF26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF27 */
#define IFX_CAN_N_TX_BCF_CF27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF27 */
#define IFX_CAN_N_TX_BCF_CF27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF27 */
#define IFX_CAN_N_TX_BCF_CF27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF28 */
#define IFX_CAN_N_TX_BCF_CF28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF28 */
#define IFX_CAN_N_TX_BCF_CF28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF28 */
#define IFX_CAN_N_TX_BCF_CF28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF29 */
#define IFX_CAN_N_TX_BCF_CF29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF29 */
#define IFX_CAN_N_TX_BCF_CF29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF29 */
#define IFX_CAN_N_TX_BCF_CF29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF30 */
#define IFX_CAN_N_TX_BCF_CF30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF30 */
#define IFX_CAN_N_TX_BCF_CF30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF30 */
#define IFX_CAN_N_TX_BCF_CF30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BCF_Bits.CF31 */
#define IFX_CAN_N_TX_BCF_CF31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCF_Bits.CF31 */
#define IFX_CAN_N_TX_BCF_CF31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCF_Bits.CF31 */
#define IFX_CAN_N_TX_BCF_CF31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE0 */
#define IFX_CAN_N_TX_BTIE_TIE0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE0 */
#define IFX_CAN_N_TX_BTIE_TIE0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE0 */
#define IFX_CAN_N_TX_BTIE_TIE0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE1 */
#define IFX_CAN_N_TX_BTIE_TIE1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE1 */
#define IFX_CAN_N_TX_BTIE_TIE1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE1 */
#define IFX_CAN_N_TX_BTIE_TIE1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE2 */
#define IFX_CAN_N_TX_BTIE_TIE2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE2 */
#define IFX_CAN_N_TX_BTIE_TIE2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE2 */
#define IFX_CAN_N_TX_BTIE_TIE2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE3 */
#define IFX_CAN_N_TX_BTIE_TIE3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE3 */
#define IFX_CAN_N_TX_BTIE_TIE3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE3 */
#define IFX_CAN_N_TX_BTIE_TIE3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE4 */
#define IFX_CAN_N_TX_BTIE_TIE4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE4 */
#define IFX_CAN_N_TX_BTIE_TIE4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE4 */
#define IFX_CAN_N_TX_BTIE_TIE4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE5 */
#define IFX_CAN_N_TX_BTIE_TIE5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE5 */
#define IFX_CAN_N_TX_BTIE_TIE5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE5 */
#define IFX_CAN_N_TX_BTIE_TIE5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE6 */
#define IFX_CAN_N_TX_BTIE_TIE6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE6 */
#define IFX_CAN_N_TX_BTIE_TIE6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE6 */
#define IFX_CAN_N_TX_BTIE_TIE6_OFF (6u)

